
# Case 1 : When independent variable has only 2 values.

### Point biserial Correlation

Eg. Male/Female, or Yes/No , True/False,

In [1]:
import pandas as pd
import numpy as np

Lets create dataframe which will consist of 2 columns : <b>EmpType and Salary.</b>

Purposely we will assign more salary to Type 1 Employee. So we will get some correlation between EmpType and Salary.

Mean of Type 1 employee is 60 with standard deviation 5<br>
Mean of Type 2 employee is 50 with standard deviation 5

In [2]:
num1=np.random.normal(loc=60,scale=5,size=100)
df1=pd.DataFrame(num1,columns=['Salary'])
df1['Type']='EmpType1'

num2=np.random.normal(loc=50,scale=5,size=100)
df2=pd.DataFrame(num2,columns=['Salary'])
df2['Type']='EmpType2'

In [3]:
display(df1.head(2))
display(df2.head(2))

     Salary      Type
0  55.80387  EmpType1
1  69.51700  EmpType1

      Salary      Type
0  52.858308  EmpType2
1  49.169934  EmpType2

Concatinate above two data into one dataset

In [4]:
df=pd.concat([df1,df2],axis=0)

In [5]:
df.head()

      Salary      Type
0  55.803870  EmpType1
1  69.517000  EmpType1
2  60.091652  EmpType1
3  57.287639  EmpType1
4  58.711204  EmpType1

Since Categorical variable 'Type' has only 2 values we will convert it into numeric (0 and 1) datatype.

In [6]:
df['TypeInt']=(df['Type']=='EmpType1').astype(int)

In [7]:
df.head()

      Salary      Type  TypeInt
0  55.803870  EmpType1        1
1  69.517000  EmpType1        1
2  60.091652  EmpType1        1
3  57.287639  EmpType1        1
4  58.711204  EmpType1        1

In [8]:
df.corr()

           Salary   TypeInt
Salary   1.000000  0.736262
TypeInt  0.736262  1.000000

Correlation between EmpType and Salary is 0.7. So we can determine it is correlated.

<u>TRY</u>

Try above method by creating dataset with different mean and sd for type1 and type2


# Case 2 : When independent variable has more than 2 values.

### <u>ANOVA</u>

Again purposely we will assign more salary to Type 1 Employee, avg salary to Type 2 Employee and low salary to Type 3 employee. So we will get some correlation between EmpType and Salary.

Mean of Type 1 employee is 90 with standard deviation 5<br>
Mean of Type 2 employee is 70 with standard deviation 5<br>
Mean of Type 3 employee is 50 with standard deviation 5<br>

In [9]:
num1=np.random.normal(loc=90,scale=5,size=100)
df1=pd.DataFrame(num1,columns=['Salary'])
df1['Type']='EmpType1'

num2=np.random.normal(loc=70,scale=5,size=100)
df2=pd.DataFrame(num2,columns=['Salary'])
df2['Type']='EmpType2'

num3=np.random.normal(loc=50,scale=5,size=100)
df3=pd.DataFrame(num3,columns=['Salary'])
df3['Type']='EmpType3'

In [10]:
display(df1.head(2))
display(df2.head(2))
display(df3.head(2))

      Salary      Type
0  80.997544  EmpType1
1  80.716839  EmpType1

      Salary      Type
0  73.798007  EmpType2
1  74.731847  EmpType2

      Salary      Type
0  54.178752  EmpType3
1  49.846284  EmpType3

In [11]:
df=pd.concat([df1,df2,df3],axis=0)

from scipy import stats
 
F, p = stats.f_oneway(df[df.Type=='EmpType1'].Salary,
                      df[df.Type=='EmpType2'].Salary,
                      df[df.Type=='EmpType3'].Salary)

F, p

(1443.6261043929649, 1.0179468469807724e-153)

Again lets create dataframe with almost equal salary to all Employee. And lets see the F score.

In [12]:
num1=np.random.normal(loc=60,scale=5,size=100)
df1=pd.DataFrame(num1,columns=['Salary'])
df1['Type']='EmpType1'

num2=np.random.normal(loc=55,scale=5,size=100)
df2=pd.DataFrame(num2,columns=['Salary'])
df2['Type']='EmpType2'


num3=np.random.normal(loc=50,scale=5,size=100)
df3=pd.DataFrame(num3,columns=['Salary'])
df3['Type']='EmpType3'

In [13]:
df=pd.concat([df1,df2,df3],axis=0)

from scipy import stats
 
F, p = stats.f_oneway(df[df.Type=='EmpType1'].Salary,
                      df[df.Type=='EmpType2'].Salary,
                      df[df.Type=='EmpType3'].Salary)

F, p

(86.50818230414401, 2.4863103107825594e-30)

In 1st example F score is 1443 and 2nd example F score is 86.<br>
Higher the F score, more the correlation.


If F score is towards 0, then there is no correlation between categorical column and continuous column. (go through below example)

In [14]:
num1=np.random.normal(loc=50,scale=5,size=100)
df1=pd.DataFrame(num1,columns=['Salary'])
df1['Type']='EmpType1'

num2=np.random.normal(loc=50,scale=5,size=100)
df2=pd.DataFrame(num2,columns=['Salary'])
df2['Type']='EmpType2'


num3=np.random.normal(loc=50,scale=5,size=100)
df3=pd.DataFrame(num3,columns=['Salary'])
df3['Type']='EmpType3'

In [15]:
df=pd.concat([df1,df2,df3],axis=0)

from scipy import stats
 
F, p = stats.f_oneway(df[df.Type=='EmpType1'].Salary,
                      df[df.Type=='EmpType2'].Salary,
                      df[df.Type=='EmpType3'].Salary)


F, p

(1.8386059723849753, 0.16084453572413984)